<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Download recipe for the Tenable Nessus Agent.</string>
        <key>Identifier</key>
        <string>com.github.skoobasteeve.download.NessusAgent</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>Nessus Agent</string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.5.0</string>
        <key>Process</key>
        <array>
           <dict>
                <key>Processor</key>
                <string>URLTextSearcher</string>
                <key>Arguments</key>
                <dict>
                    <key>url</key>
                    <string>https://www.tenable.com/downloads/nessus-agents</string>
                    <key>result_output_var_name</key>
                    <string>download_id</string>
                    <key>re_pattern</key>
                    <string>"id":([\d]*)(?=,"file":"NessusAgent-[\d\.]*\.dmg)</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>URLTextSearcher</string>
                <key>Arguments</key>
                <dict>
                    <key>url</key>
                    <string>https://www.tenable.com/downloads/nessus-agents</string>
                    <key>result_output_var_name</key>
                    <string>version</string>
                    <key>re_pattern</key>
                    <string>NessusAgent-([\d\.]*)\.dmg</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>URLDownloader</string>
                <key>Arguments</key>
                <dict>
                    <key>url</key>
                    <string>https://www.tenable.com/downloads/api/v1/public/pages/nessus-agents/downloads/%download_id%/download?i_agree_to_tenable_license_agreement=true</string>
                    <key>CHECK_FILESIZE_ONLY</key>
                    <true />
                    <key>filename</key>
                    <string>%NAME%-%version%.dmg</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>CodeSignatureVerifier</string>
                <key>Arguments</key>
                <dict>
                    <key>input_path</key>
                    <string>%pathname%/Install Nessus Agent.pkg</string>
                    <key>expected_authority_names</key>
                    <array>
                        <string>Developer ID Installer: Tenable Network Security, Inc. (4B8J598M7U)</string>
                        <string>Developer ID Certification Authority</string>
                        <string>Apple Root CA</string>
                    </array>
                </dict>
            </dict>
            <dict>
				<key>Processor</key>
				<string>PkgCopier</string>
				<key>Arguments</key>
				<dict>
					<key>source_pkg</key>
					<string>%pathname%/.NessusAgent.pkg</string>
					<key>pkg_path</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
				</dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>EndOfCheckPhase</string>
            </dict>
        </array>
    </dict>
</plist>